In [48]:
import pandas as pd
import numpy as np

In [49]:
main_data = pd.read_json("practice_dataset1.json")
print(main_data)

   id   name  age sex   salary   bmi  children smoker region department  \
0   1   John   28   M  55000.0  24.5       2.0    Yes  North      Sales
1   2   Jane   34   F  62000.0  22.1       1.0     No  South  Marketing
2   3    Bob   45   M  70000.0  27.8       3.0    Yes   East         IT
3   4  Alice   29   F  58000.0  23.4       0.0     No   West         HR
4   5   Mike   38   M  65000.0  28.2       NaN    Yes  North    Finance
5   6  Linda   31   F  60000.0  21.9       2.0     No  South         IT
6   7  Steve   42   M  72000.0  26.5       1.0    Yes   East  Marketing
7   8  Karen   36   F      NaN  24.9       2.0     No   West      Sales
8   9    Tom   39   M  68000.0  29.1       3.0    Yes  North    Finance
9  10  Susan   33   F  61000.0  23.0       1.0     No  South         HR

    join_date  is_manager
0  2020-01-15       False
1  2019-06-23        True
2  2015-09-10       False
3  2021-03-12       False
4  2018-12-01        True
5  2020-07-08       False
6  2016-11-20        True
7  2017-04-30       False
8  2015-05-14       False
9  2019-08-25       False

In [50]:
#DataFrame এ মোট কয়টি row ও column আছে তা বের করো।
main_data.shape

(10, 12)

In [51]:
#সব column এর নাম বের করো।
print(list(main_data.columns))

['id', 'name', 'age', 'sex', 'salary', 'bmi', 'children', 'smoker', 'region', 'department', 'join_date', 'is_manager']

In [52]:
#row index কেমনভাবে সাজানো আছে তা দেখাও।
main_data.index

RangeIndex(start=0, stop=10, step=1)

In [53]:
#প্রতিটি column-এর data type নির্ণয় করো।
main_data.dtypes

id              int64
name           object
age             int64
sex            object
salary        float64
bmi           float64
children      float64
smoker         object
region         object
department     object
join_date      object
is_manager       bool
dtype: object

In [54]:
#DataFrame এর সম্পূর্ণ summary report দেখাও।
main_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   name        10 non-null     object
 2   age         10 non-null     int64
 3   sex         10 non-null     object
 4   salary      9 non-null      float64
 5   bmi         10 non-null     float64
 6   children    9 non-null      float64
 7   smoker      10 non-null     object
 8   region      10 non-null     object
 9   department  10 non-null     object
 10  join_date   10 non-null     object
 11  is_manager  10 non-null     bool
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 1022.0+ bytes

In [55]:
#DataFrame-এ মোট কয়টি element (cell) আছে তা বের করো।
main_data.size

120

In [56]:
#DataFrame-এর dimension সংখ্যা বের করো।
main_data.ndim

2

In [57]:
#DataFrame-এর সব value কে numpy array আকারে দেখাও।
main_data.values

array([[1, 'John', 28, 'M', 55000.0, 24.5, 2.0, 'Yes', 'North', 'Sales',
        '2020-01-15', False],
       [2, 'Jane', 34, 'F', 62000.0, 22.1, 1.0, 'No', 'South',
        'Marketing', '2019-06-23', True],
       [3, 'Bob', 45, 'M', 70000.0, 27.8, 3.0, 'Yes', 'East', 'IT',
        '2015-09-10', False],
       [4, 'Alice', 29, 'F', 58000.0, 23.4, 0.0, 'No', 'West', 'HR',
        '2021-03-12', False],
       [5, 'Mike', 38, 'M', 65000.0, 28.2, nan, 'Yes', 'North',
        'Finance', '2018-12-01', True],
       [6, 'Linda', 31, 'F', 60000.0, 21.9, 2.0, 'No', 'South', 'IT',
        '2020-07-08', False],
       [7, 'Steve', 42, 'M', 72000.0, 26.5, 1.0, 'Yes', 'East',
        'Marketing', '2016-11-20', True],
       [8, 'Karen', 36, 'F', nan, 24.9, 2.0, 'No', 'West', 'Sales',
        '2017-04-30', False],
       [9, 'Tom', 39, 'M', 68000.0, 29.1, 3.0, 'Yes', 'North', 'Finance',
        '2015-05-14', False],
       [10, 'Susan', 33, 'F', 61000.0, 23.0, 1.0, 'No', 'South', 'HR',
        '2019-08-25', False]], dtype=object)

In [58]:
#DataFrame-এর সব value কে numpy array আকারে দেখাও।
main_data.to_numpy

<bound method DataFrame.to_numpy of    id   name  age sex   salary   bmi  children smoker region department  \
0   1   John   28   M  55000.0  24.5       2.0    Yes  North      Sales
1   2   Jane   34   F  62000.0  22.1       1.0     No  South  Marketing
2   3    Bob   45   M  70000.0  27.8       3.0    Yes   East         IT
3   4  Alice   29   F  58000.0  23.4       0.0     No   West         HR
4   5   Mike   38   M  65000.0  28.2       NaN    Yes  North    Finance
5   6  Linda   31   F  60000.0  21.9       2.0     No  South         IT
6   7  Steve   42   M  72000.0  26.5       1.0    Yes   East  Marketing
7   8  Karen   36   F      NaN  24.9       2.0     No   West      Sales
8   9    Tom   39   M  68000.0  29.1       3.0    Yes  North    Finance
9  10  Susan   33   F  61000.0  23.0       1.0     No  South         HR

    join_date  is_manager
0  2020-01-15       False
1  2019-06-23        True
2  2015-09-10       False
3  2021-03-12       False
4  2018-12-01        True
5  2020-07-08       False
6  2016-11-20        True
7  2017-04-30       False
8  2015-05-14       False
9  2019-08-25       False  >

In [59]:
main_data.T

,0,1,2,3,4,5,6,7,8,9
id,1,2,3,4,5,6,7,8,9,10
name,John,Jane,Bob,Alice,Mike,Linda,Steve,Karen,Tom,Susan
age,28,34,45,29,38,31,42,36,39,33
sex,M,F,M,F,M,F,M,F,M,F
salary,55000.0,62000.0,70000.0,58000.0,65000.0,60000.0,72000.0,NaN,68000.0,61000.0
bmi,24.5,22.1,27.8,23.4,28.2,21.9,26.5,24.9,29.1,23.0
children,2.0,1.0,3.0,0.0,NaN,2.0,1.0,2.0,3.0,1.0
smoker,Yes,No,Yes,No,Yes,No,Yes,No,Yes,No
region,North,South,East,West,North,South,East,West,North,South
department,Sales,Marketing,IT,HR,Finance,IT,Marketing,Sales,Finance,HR
join_date,2020-01-15,2019-06-23,2015-09-10,2021-03-12,2018-12-01,2020-07-08,2016-11-20,2017-04-30,2015-05-14,2019-08-25
is_manager,False,True,False,False,True,False,True,False,False,False

In [60]:
#প্রথম ৫টি row প্রদর্শন করো।
main_data.head()

,id,name,age,sex,salary,bmi,children,smoker,region,department,join_date,is_manager
0,1,John,28,M,55000.0,24.5,2.0,Yes,North,Sales,2020-01-15,False
1,2,Jane,34,F,62000.0,22.1,1.0,No,South,Marketing,2019-06-23,True
2,3,Bob,45,M,70000.0,27.8,3.0,Yes,East,IT,2015-09-10,False
3,4,Alice,29,F,58000.0,23.4,0.0,No,West,HR,2021-03-12,False
4,5,Mike,38,M,65000.0,28.2,NaN,Yes,North,Finance,2018-12-01,True

In [61]:
#শেষ ৩টি row প্রদর্শন করো।
main_data.tail(3)

,id,name,age,sex,salary,bmi,children,smoker,region,department,join_date,is_manager
7,8,Karen,36,F,NaN,24.9,2.0,No,West,Sales,2017-04-30,False
8,9,Tom,39,M,68000.0,29.1,3.0,Yes,North,Finance,2015-05-14,False
9,10,Susan,33,F,61000.0,23.0,1.0,No,South,HR,2019-08-25,False

In [62]:
#সব numeric column এর summary statistics দেখাও।
main_data.describe()

             id        age        salary        bmi  children
count  10.00000  10.000000      9.000000  10.000000  9.000000
mean    5.50000  35.500000  63444.444444  25.140000  1.666667
std     3.02765   5.562773   5703.312877   2.620093  1.000000
min     1.00000  28.000000  55000.000000  21.900000  0.000000
25%     3.25000  31.500000  60000.000000  23.100000  1.000000
50%     5.50000  35.000000  62000.000000  24.700000  2.000000
75%     7.75000  38.750000  68000.000000  27.475000  2.000000
max    10.00000  45.000000  72000.000000  29.100000  3.000000

In [63]:
#প্রতিটি column-এ কয়টি non-null মান আছে তা বের করো।
main_data.count()

id            10
name          10
age           10
sex           10
salary         9
bmi           10
children       9
smoker        10
region        10
department    10
join_date     10
is_manager    10
dtype: int64

In [64]:
#DataFrame-এর সব numeric column-এর গড় বের করো।
numeric_value = main_data.select_dtypes(include='number')
mean_value = numeric_value.mean()
print(mean_value)

id              5.500000
age            35.500000
salary      63444.444444
bmi            25.140000
children        1.666667
dtype: float64

In [65]:
numeric_value = main_data.select_dtypes(include='number')
for col in numeric_value:
    mean_values = numeric_value[col].mean()
    print(col, mean_values)

id 5.5
age 35.5
salary 63444.444444444445
bmi 25.14
children 1.6666666666666667

In [66]:
#“Salary” column-এর সর্বনিম্ন, সর্বোচ্চ এবং median বের করো।
main_data['salary'].min()

np.float64(55000.0)

In [67]:
main_data['salary'].max()

np.float64(72000.0)

In [68]:
main_data['salary'].median()

np.float64(62000.0)

In [69]:
#“Age” column-এর সব মান যোগ করো
main_data['age'].sum()

np.int64(355)

In [70]:
main_data[['age']]

   age
0   28
1   34
2   45
3   29
4   38
5   31
6   42
7   36
8   39
9   33

In [71]:
main_data['department'].nunique()

5

In [72]:
main_data['department'].unique()

array(['Sales', 'Marketing', 'IT', 'HR', 'Finance'], dtype=object)

In [73]:
#“Department” column-এর প্রতিটি মান কয়বার এসেছে তা গণনা করো।
main_data['department'].value_counts()

department
Sales        2
Marketing    2
IT           2
HR           2
Finance      2
Name: count, dtype: int64

In [74]:
#“Gender” column-এর unique মানগুলো বের করো।
main_data['sex'].unique()

array(['M', 'F'], dtype=object)

In [75]:
main_data['sex'].nunique()

2

In [80]:
#DataFrame-এর প্রথম ৪টি row এবং শেষ ২টি row একসাথে প্রদর্শন করো।
first4 = main_data.head(4)
last2 = main_data.tail(2)
first_last = pd.concat([first4, last2], ignore_index=True)
print(first_last)

   id   name  age sex   salary   bmi  children smoker region department  \
0   1   John   28   M  55000.0  24.5       2.0    Yes  North      Sales
1   2   Jane   34   F  62000.0  22.1       1.0     No  South  Marketing
2   3    Bob   45   M  70000.0  27.8       3.0    Yes   East         IT
3   4  Alice   29   F  58000.0  23.4       0.0     No   West         HR
4   9    Tom   39   M  68000.0  29.1       3.0    Yes  North    Finance
5  10  Susan   33   F  61000.0  23.0       1.0     No  South         HR

    join_date  is_manager
0  2020-01-15       False
1  2019-06-23        True
2  2015-09-10       False
3  2021-03-12       False
4  2015-05-14       False
5  2019-08-25       False